In [13]:
import pandas as pd

### 엑셀 통으로 읽어오기
1. 파일 위치 "./src/data1.xlsx"

In [14]:
df = pd.read_excel('./src/data1.xlsx')
df

      ID  name                     email   notice   salary  remarks
0  A0001   Kim  jongbaekim0710@gmail.com  action1  1000000      NaN
1  A0002  Yoon  jongbaekim0710@gmail.com  action2  2000000      NaN
2  A0003  Kang  jongbaekim0710@gmail.com  action3  3000000  특이사항 체크
3  A0004  Park  jongbaekim0710@gmail.com  action4  4000000      NaN
4  A0005   Lee  jongbaekim0710@gmail.com  action5  5000000      NaN

### 특정 열 읽어오기

In [15]:
df_name = df["name"]
print(df_name)
print(type(df_name))    # 데이터 타입 시리즈

0     Kim
1    Yoon
2    Kang
3    Park
4     Lee
Name: name, dtype: object
<class 'pandas.core.series.Series'>

In [16]:
df_name = df[["name"]]
print(df_name)
print(type(df_name))    # 테이터 타입 데이터프레임

   name
0   Kim
1  Yoon
2  Kang
3  Park
4   Lee
<class 'pandas.core.frame.DataFrame'>

In [17]:
df_name_notice = df[["name", "notice"]]
df_name_notice

   name   notice
0   Kim  action1
1  Yoon  action2
2  Kang  action3
3  Park  action4
4   Lee  action5

### 특정 행 불러오기

In [23]:
df_row1 = df.iloc[1:4]    # 인뎃스 정보로 특정행 불러오기
df_row1

      ID  name                     email   notice   salary  remarks
1  A0002  Yoon  jongbaekim0710@gmail.com  action2  2000000      NaN
2  A0003  Kang  jongbaekim0710@gmail.com  action3  3000000  특이사항 체크
3  A0004  Park  jongbaekim0710@gmail.com  action4  4000000      NaN

### 순차적으로 불러오기

In [50]:
df["ID"]

0    A0001
1    A0002
2    A0003
3    A0004
4    A0005
Name: ID, dtype: object

In [51]:
for id in df["ID"]:
    print(id)

A0001
A0002
A0003
A0004
A0005

In [66]:
for id in df["ID"]:
    target= df[df["ID"] == id][["email", "notice"]]
    print(target.values[0])

['jongbaekim0710@gmail.com' 'action1']
['jongbaekim0710@gmail.com' 'action2']
['jongbaekim0710@gmail.com' 'action3']
['jongbaekim0710@gmail.com' 'action4']
['jongbaekim0710@gmail.com' 'action5']